**Importing pandas**

In [24]:
import pandas as pd

**Reading the cleaned dataframe and the first dataframe, getting rid of the state names, and creating the cities list**

In [25]:
df=pd.read_csv('data_jobs_cleaned.csv')
df_us_job_counts=pd.read_csv('1_data_jobs_location_counts.csv')
df['job_location'] = df['job_location'].str.split(',', expand=True)[0].str.strip()
cities_list=df_us_job_counts['job_location'].tolist()
cities_list

['New York', 'Atlanta', 'Chicago', 'Dallas', 'Austin']

**Filtering for the 5 cities**

In [26]:
df_5_cities=df[df['job_location'].isin(cities_list)]

**Grouping the dataframe by job title and city**

In [27]:
df_5_cities=df_5_cities[df_5_cities['job_title_short'].str.contains('Analyst')]
df_5_cities=df_5_cities.groupby(['job_title_short', 'job_location']).size()

In [28]:
df_5_cities=df_5_cities.reset_index(name='count')

In [29]:
df_5_cities

        job_title_short job_location  count
0      Business Analyst      Atlanta    298
1      Business Analyst       Austin    196
2      Business Analyst      Chicago    221
3      Business Analyst       Dallas    204
4      Business Analyst     New York    158
5          Data Analyst      Atlanta   1711
6          Data Analyst       Austin   1235
7          Data Analyst      Chicago   1442
8          Data Analyst       Dallas   1170
9          Data Analyst     New York   2170
10  Senior Data Analyst      Atlanta    410
11  Senior Data Analyst       Austin    167
12  Senior Data Analyst      Chicago    324
13  Senior Data Analyst       Dallas    235
14  Senior Data Analyst     New York    389

**Writing the dataframe into a csv file**

In [30]:
df_5_cities.to_csv('3_da_job_postings.csv', index=False)